app/controllers/api/sample_packs_controller.rb

SELECT "sample_packs".* FROM "sample_packs"
---
    def index
        @sample_packs = SamplePack.all

SELECT  "sample_packs".* FROM "sample_packs" WHERE "sample_packs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @sample_pack = SamplePack.find(params[:id])