app/controllers/api/samples_controller.rb

SELECT "samples".* FROM "samples" WHERE "samples"."pack_id" = $1  [["pack_id", 2]]
---
    def index
        @samples = Sample.where(pack_id: params[:sample_pack_id])