app/views/api/sample_packs/_pack.json.jbuilder

SELECT "samples".* FROM "samples" WHERE "samples"."pack_id" = $1  [["pack_id", 1]]
---
    json.extract! sample_pack, :name, :description
    @sample_pack.samples.each do |sample|