app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "youngcitrus"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "yc@gmail.com"], ["LIMIT", 1]]
---
    def self.find_by_credentials(input, password)
        user = User.find_by(username: input);
        user ||= User.find_by(email: input);